# 在 「力扣挑战赛」 开幕式的压轴节目 「无人机方阵」中，每一架无人机展示一种灯光颜色。 无人机方阵通过两种操作进行颜色图案变换：
# - 调整无人机的位置布局
# - 切换无人机展示的灯光颜色
# 
# 
# 给定两个大小均为 `N*M` 的二维数组 `source` 和 `target` 表示无人机方阵表演的两种颜色图案，由于无人机切换灯光颜色的耗能很大，请返回
# 从 `source` 到 `target` 最少需要多少架无人机切换灯光颜色。
# 
# 
# **注意：** 调整无人机的位置布局时无人机的位置可以随意变动。
# 
# 
# **示例 1：**
# > 输入：`source = [[1,3],[5,4]], target = [[3,1],[6,5]]`
# >
# > 输出：`1`
# >
# > 解释：
# > 最佳方案为
# 将 `[0,1]` 处的无人机移动至 `[0,0]` 处；
# 将 `[0,0]` 处的无人机移动至 `[0,1]` 处；
# 将 `[1,0]` 处的无人机移动至 `[1,1]` 处；
# 将 `[1,1]` 处的无人机移动至 `[1,0]` 处，其灯光颜色切换为颜色编号为 `6` 的灯光；
# 因此从`source` 到 `target` 所需要的最少灯光切换次数为 1。
# >![8819ccdd664e91c78cde3bba3c701986.gif](https://pic.leetcode-cn.com/162882376
# 5-uCDaux-8819ccdd664e91c78cde3bba3c701986.gif){:height=300px}
# 
# 
# 
# 
# 
# **示例 2：**
# > 输入：`source = [[1,2,3],[3,4,5]], target = [[1,3,5],[2,3,4]]`
# >
# > 输出：`0`
# > 解释：
# > 仅需调整无人机的位置布局，便可完成图案切换。因此不需要无人机切换颜色
# 
# 
# **提示：**
# `n == source.length == target.length`
# `m == source[i].length == target[i].length`
# `1 <= n, m <=100`
# `1 <= source[i][j], target[i][j] <=10^4`
# 
# 
# 
#  Related Topics 数组 哈希表 计数 矩阵 👍 5 👎 0


# leetcode submit region begin(Prohibit modification and deletion)
from collections import Counter


class Solution(object):
    def minimumSwitchingTimes(self, source, target):
        """
        :type source: List[List[int]]
        :type target: List[List[int]]
        :rtype: int
        """
        c1, c2, res = Counter(sum(source, [])), Counter(sum(target, [])), 0
        for i in set(c1) | set(c2):
            res += abs(c2[i] - c1[i])
        return res // 2


# leetcode submit region end(Prohibit modification and deletion)
a = [989, 498, 941, 850, 992, 367, 914, 224, 143, 144, 98, 819, 932, 723, 617, 151, 102, 76, 871, 339, 574, 363, 324,
     656, 210, 566, 454, 534, 64, 941, 938, 96, 861, 728, 804, 641, 627, 848, 342, 748, 721, 65, 940, 228, 823, 146,
     557, 94, 328, 521, 502, 309, 299, 128, 341, 945, 209, 819, 561, 295, 94, 818, 325, 248, 189, 842, 34, 673, 488, 92,
     776, 898, 946, 863, 920, 946, 554, 401, 723, 283, 832, 870, 917, 604, 973, 594, 462, 677, 718, 813, 85, 628, 499,
     646, 866, 249, 750, 120, 226, 814]
b = [524, 415, 803, 311, 489, 598, 930, 517, 289, 774, 634, 257, 546, 830, 924, 318, 748, 921, 701, 484, 104, 445, 626,
     935, 990, 489, 887, 267, 825, 562, 15, 737, 409, 845, 685, 2, 506, 889, 250, 334, 892, 196, 582, 245, 991, 823,
     459, 83, 897, 956, 112, 565, 724, 561, 835, 554, 987, 618, 602, 456, 611, 395, 590, 298, 194, 192, 628, 267, 71,
     696, 134, 154, 40, 83, 717, 850, 700, 858, 538, 535, 242, 221, 696, 846, 430, 282, 505, 657, 939, 366, 333, 119,
     602, 344, 195, 17, 278, 723, 381, 175]
ans = 0
for i in a:
    if i not in b:
        ans += 1
print(ans)
